app/controllers/clients_controller.rb

  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("created_at", "description", "email", "name", "phone_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update

    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "clients" SET "description" = 'This is a new client! !', "updated_at" = '2014-02-28 20:13:20.756781' WHERE "clients"."id" = 1