app/controllers/reviews_controller.rb

  def create
    @review = Review.new(params[:review])

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("created_at", "email", "name", "review", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 24 Feb 2014 22:01:46 UTC +00:00], ["email", ""], ["name", ""], ["review", ""], ["updated_at", Mon, 24 Feb 2014 22:01:46 UTC +00:00]]

  def update
    @review = Review.find(params[:id])
    respond_to do |format|
      if @review.update_attributes(params[:review])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "reviews" SET "name" = 'Vois is the man!', "email" = 'Voisyvoisvoishannah@gmail.com', "review" = 'hey ya''ll super awesome appppppp!', "updated_at" = '2014-02-24 22:06:16.222419' WHERE "reviews"."id" = 4