app/controllers/services_controller.rb

  def show
    @service = Service.find(params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT 1  [["id", "5"]]

  def edit
    @service = Service.find(params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @service = Service.new(params[:service])

    respond_to do |format|
      if @service.save
---
INSERT INTO "services" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 24 Feb 2014 19:25:05 UTC +00:00], ["description", nil], ["name", nil], ["updated_at", Mon, 24 Feb 2014 19:25:05 UTC +00:00]]

  def update

    @service = Service.find(params[:id])

    respond_to do |format|
      if @service.update_attributes(params[:service])
---
SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "services" SET "description" = 'Ok maybe he does, and no you''re not supposed ot understand this', "updated_at" = '2014-02-24 20:01:22.527009' WHERE "services"."id" = 10

  def destroy
    @service = Service.find(params[:id])
    @service.destroy
---
SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "services" WHERE "services"."id" = ?  [["id", 6]]

  def client
    @services = Service.all
---
SELECT "services".* FROM "services"