app/controllers/static_pages_controller.rb

  def create

    @client = Client.new(params[:client])

    # respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("created_at", "description", "email", "name", "phone_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def index
    @services = Service.all
    @reviews = Review.where(:active => true)
---
SELECT "services".* FROM "services"
SELECT "reviews".* FROM "reviews" WHERE "reviews"."active" = 't'